week-07-church-turing-thesis-and-lambda-calculus/slides.tex
% Created 2023-04-24 Mon 17:10
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{default}
\author{Mathematical Logic Course}
\date{\today}
\title{Week 7: Church-Turing Thesis and Lambda Calculus}
\hypersetup{
 pdfauthor={Mathematical Logic Course},
 pdftitle={Week 7: Church-Turing Thesis and Lambda Calculus},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\begin{frame}[label={sec:orga4a6093}]{Introduction}
\begin{itemize}
\item Welcome to Week 7 of our Mathematical Logic Course!
\item This week, we'll explore the Church-Turing Thesis and Lambda Calculus.
\item We'll cover the following topics:
\begin{itemize}
\item Church-Turing Thesis: statement and implications
\item Introduction to lambda calculus
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org160b7ee}]{Church-Turing Thesis}
\begin{itemize}
\item What is the Church-Turing Thesis?
\item Alonzo Church and Alan Turing's contributions to computability theory
\item The equivalence of Turing machines, lambda calculus, and recursive functions
\item Implications of the Church-Turing Thesis for the limits of computation
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org5d58fdf}]{Lambda Calculus}
\begin{itemize}
\item What is lambda calculus?
\item Formalization of lambda calculus: syntax and semantics
\item Lambda expressions, abstraction, and application
\item Examples of lambda expressions and their evaluation
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4addc3a}]{Reductions and Combinators}
\begin{itemize}
\item Reduction strategies in lambda calculus
\item Normal order, applicative order, and normal forms
\item Introduction to combinatory logic and combinators
\item Examples of combinators and their use in lambda calculus
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4dc75fd}]{Summary and Conclusion}
\begin{itemize}
\item Recap of the topics covered in this lecture
\item Church-Turing Thesis and its foundational role in computer science
\item Lambda calculus and its expressive power
\item Next week, we'll explore the Halting Problem and Undecidability
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org2426a39}]{Questions and Discussion}
\begin{itemize}
\item Do you have any questions about today's lecture?
\item Let's discuss the material and explore any questions you may have
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org308cbc4}]{Coding Exercises}
\begin{itemize}
\item Implementing lambda expressions and basic evaluation rules in Python
\item Exploring the expressive power of lambda calculus through examples
\end{itemize}
\end{frame}
\end{document}